Domain – Education

focus – Data analysis


Business challenge/requirement

You are a data analyst with University of Cal USA (Not a machine learning expert yet as you still have not completed ML with Python Course :-)).The University has data of Math, Physics and Data Structure score of sophomore students. This data is stored in different files. The University has hired a data science company to do analysis of scores and find if there is any correlation of score with age, ethnicity etc. Before the data is given to the company you have to do data wrangling.




Key issues

Ensure students identify is not revealed to the agency and only relevant data is shared



Considerations
NONE


Data volume

In thousands, but only around 1800 records are shared in files MathScoreTerm1.csv DSScoreTerm1.csv, PhysicsScoreTerm1.csv


Additional information
- NA



Business benefits

University can get more students enrollment by improving its international ranking through personalized course/curriculum for students








Approach to Solve
You have to use fundamentals of Numpy and Pandas

In [1]:
import pandas as pd
import numpy as np
import os

1. Read the three csv files which contains the score of same students in term1 for each Subject

In [2]:
os.chdir('C:/Users/USER/Downloads/Batch 98 Day 11/CS 16 Ans -Data Transformation-2')
os.getcwd()

'C:\\Users\\USER\\Downloads\\Batch 98 Day 11\\CS 16 Ans -Data Transformation-2'

In [38]:
math_data = pd.read_csv('MathScoreTerm1.csv')

In [4]:
math_data.head()

             Name  Score  Age         Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18     White American   Maths   M   1
1     ALAN HARVEY   85.0   19  European American   Maths   M   2
2    ALAN REYNAUD   45.0   19  European American   Maths   M   3
3  ALBERT CENDANA   82.0   18     White American   Maths   M   4
4  ALBERT HOLT JR   82.0   18     White American   Maths   F   5

In [39]:
ds_data = pd.read_csv('DSScoreTerm1.csv')

In [6]:
ds_data.head()

             Name  Score  Age         Ethinicity        Subject Sex  ID
0  AI-KYUNG CHUNG   82.0   18     White American  Data Structue   M   1
1     ALAN HARVEY   79.0   19  European American  Data Structue   M   2
2    ALAN REYNAUD   39.0   19  European American  Data Structue   M   3
3  ALBERT CENDANA   76.0   18     White American  Data Structue   M   4
4  ALBERT HOLT JR   76.0   18     White American  Data Structue   F   5

In [40]:
physics_data = pd.read_csv('PhysicsScoreTerm1.csv')

In [8]:
physics_data.head()

             Name  Score  Age         Ethinicity  Subject Sex  ID
0  AI-KYUNG CHUNG   84.0   18     White American  Physics   M   1
1     ALAN HARVEY   81.0   19  European American  Physics   M   2
2    ALAN REYNAUD   41.0   19  European American  Physics   M   3
3  ALBERT CENDANA   78.0   18     White American  Physics   M   4
4  ALBERT HOLT JR   78.0   18     White American  Physics   F   5

2. Remove the name and ethnicity column (to ensure confidentiality)

In [9]:
math_data = math_data.drop(['Name','Ethinicity'],axis = 1)
math_data.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [10]:
ds_data = ds_data.drop(['Name','Ethinicity'],axis = 1)
ds_data.head()

   Score  Age        Subject Sex  ID
0   82.0   18  Data Structue   M   1
1   79.0   19  Data Structue   M   2
2   39.0   19  Data Structue   M   3
3   76.0   18  Data Structue   M   4
4   76.0   18  Data Structue   F   5

In [11]:
physics_data = physics_data.drop(['Name','Ethinicity'],axis = 1)
physics_data.head()

   Score  Age  Subject Sex  ID
0   84.0   18  Physics   M   1
1   81.0   19  Physics   M   2
2   41.0   19  Physics   M   3
3   78.0   18  Physics   M   4
4   78.0   18  Physics   F   5

3. Fill missing score data with zero

In [12]:
math_data.isnull().sum()

Score      3
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [13]:
ds_data.isnull().sum()

Score      8
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [14]:
physics_data.isnull().sum()

Score      6
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [15]:
math_data['Score'] = math_data['Score'].fillna(0)

In [16]:
ds_data['Score'] = ds_data['Score'].fillna(0)

In [17]:
physics_data['Score'] = physics_data['Score'].fillna(0)

In [18]:
math_data.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [19]:
ds_data.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [20]:
physics_data.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

3. Merge the three files

In [21]:
all_data = [math_data,ds_data,physics_data]

In [22]:
all_data

[     Score  Age Subject Sex   ID
 0     88.0   18   Maths   M    1
 1     85.0   19   Maths   M    2
 2     45.0   19   Maths   M    3
 3     82.0   18   Maths   M    4
 4     82.0   18   Maths   F    5
 ..     ...  ...     ...  ..  ...
 594   45.0   19   Maths   F  595
 595   75.0   18   Maths   M  596
 596   53.0   20   Maths   M  597
 597   75.0   20   Maths   M  598
 598   88.0   19   Maths   M  599

 [599 rows x 5 columns],
      Score  Age        Subject Sex   ID
 0     82.0   18  Data Structue   M    1
 1     79.0   19  Data Structue   M    2
 2     39.0   19  Data Structue   M    3
 3     76.0   18  Data Structue   M    4
 4     76.0   18  Data Structue   F    5
 ..     ...  ...            ...  ..  ...
 594   39.0   19  Data Structue   F  595
 595   69.0   18  Data Structue   M  596
 596   47.0   20  Data Structue   M  597
 597   69.0   20  Data Structue   M  598
 598    0.0   19  Data Structue   M  599

 [599 rows x 5 columns],
      Score  Age  Subject Sex   ID
 0     84.0   18  Physics   M    1
 1     81.0   19  Physics   M    2
 2     41.0   19  Physics   M    3
 3     78.0   18  Physics   M    4
 4     78.0   18  Physics   F    5
 ..     ...  ...      ...  ..  ...
 594   41.0   19  Physics   F  595
 595   71.0   18  Physics   M  596
 596   49.0   20  Physics   M  597
 597   71.0   20  Physics   M  598
 598   69.0   19  Physics   M  599

 [599 rows x 5 columns]]

4. Change Sex(M/F) Column to 1/2 for further analysis

In [23]:
for dataset in all_data:
    dataset['Sex'] = dataset['Sex'].map({'M':1,'F':2}).astype(int)

In [24]:
all_data_df = pd.concat(all_data)

In [25]:
all_data_df.head()

   Score  Age Subject  Sex  ID
0   88.0   18   Maths    1   1
1   85.0   19   Maths    1   2
2   45.0   19   Maths    1   3
3   82.0   18   Maths    1   4
4   82.0   18   Maths    2   5

In [26]:
all_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1797 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    1797 non-null   float64
 1   Age      1797 non-null   int64
 2   Subject  1797 non-null   object
 3   Sex      1797 non-null   int32
 4   ID       1797 non-null   int64
dtypes: float64(1), int32(1), int64(2), object(1)
memory usage: 77.2+ KB

6. Store the data in new file – ScoreFinal.csv

In [27]:
os.getcwd()
all_data_df.to_csv('ScoreFinal.csv,index = False')

7. Convert ethnicity to numerical value.

In [28]:
math_data_1 = pd.read_csv('MathScoreTerm1.csv')
ds_data_1 = pd.read_csv('DSScoreTerm1.csv')
physics_data_1 = pd.read_csv('PhysicsScoreTerm1.csv')

In [29]:
math_data_1['Ethinicity'].unique()

array(['White American', 'European American', 'Hispanic',
       'African American'], dtype=object)

In [30]:
ds_data_1['Ethinicity'].unique()

array(['White American', 'European American', 'Hispanic',
       'African American'], dtype=object)

In [31]:
physics_data_1['Ethinicity'].unique()

array(['White American', 'European American', 'Hispanic',
       'African American'], dtype=object)

In [32]:
all_data_2 = [math_data_1,ds_data_1,physics_data_1]

In [33]:
for dataset in all_data_2:
    dataset['Ethinicity'] = dataset['Ethinicity'].map({'White American':1,'European American':2, 'Hispanic':3,
       'African American':4}).astype(int)

In [34]:
all_data_2_df = pd.concat(all_data_2)

In [35]:
all_data_2_df.head()

             Name  Score  Age  Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18           1   Maths   M   1
1     ALAN HARVEY   85.0   19           2   Maths   M   2
2    ALAN REYNAUD   45.0   19           2   Maths   M   3
3  ALBERT CENDANA   82.0   18           1   Maths   M   4
4  ALBERT HOLT JR   82.0   18           1   Maths   F   5

In [36]:
all_data_2_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1797 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        1797 non-null   object
 1   Score       1780 non-null   float64
 2   Age         1797 non-null   int64
 3   Ethinicity  1797 non-null   int32
 4   Subject     1797 non-null   object
 5   Sex         1797 non-null   object
 6   ID          1797 non-null   int64
dtypes: float64(1), int32(1), int64(2), object(3)
memory usage: 105.3+ KB

8. Fill the missing score for a student to the average of the class

In [41]:
math_data_4 = math_data.drop(['Name','Ethinicity'],axis = 1)
ds_data_4 = ds_data.drop(['Name','Ethinicity'],axis = 1)
physics_data_4 = physics_data.drop(['Name','Ethinicity'],axis = 1) # rerun In[39,40,41]

In [42]:
math_data_4.isnull().sum()

Score      3
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [43]:
ds_data_4.isnull().sum()

Score      8
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [44]:
physics_data_4.isnull().sum()

Score      6
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [45]:
math_data_4_avg = math_data_4['Score'].mean()
ds_data_4_avg = ds_data_4['Score'].mean()
physics_data_4_avg = physics_data_4['Score'].mean()

In [46]:
math_data_4['Score'] = math_data_4['Score'].fillna(math_data_4_avg)
ds_data_4['Score'] = ds_data_4['Score'].fillna(ds_data_4_avg)
physics_data_4['Score'] = physics_data_4['Score'].fillna(physics_data_4_avg)

In [47]:
all_data = [math_data_4,ds_data_4,physics_data_4]

In [48]:
all_data_avg = pd.concat(all_data)

In [49]:
all_data_avg

     Score  Age  Subject Sex   ID
0     88.0   18    Maths   M    1
1     85.0   19    Maths   M    2
2     45.0   19    Maths   M    3
3     82.0   18    Maths   M    4
4     82.0   18    Maths   F    5
..     ...  ...      ...  ..  ...
594   41.0   19  Physics   F  595
595   71.0   18  Physics   M  596
596   49.0   20  Physics   M  597
597   71.0   20  Physics   M  598
598   69.0   19  Physics   M  599

[1797 rows x 5 columns]